feat: mermaid in md
